In [1]:
!pip install numpy
!pip install pandas
!pip install scikit-learn

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: numpy in c:\users\dell\appdata\roaming\python\python311\site-packages (1.26.4)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\dell\appdata\roaming\python\python311\site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\dell\appdata\roaming\python\python311\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\appdata\roaming\python\python311\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\appdata\roaming\python\python311\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dell\appdata\roaming\python\python311\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\dell\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: scikit-learn in c:\users\dell\appdata\roaming\python\python311\site-packages (1.4.2)
Requirement already satisfied: numpy>=1.19.5 in c:\users\dell\appdata\roaming\python\python311\site-packages (from scikit-learn) (1.26.4)
Requirement already satisfied: scipy>=1.6.0 in c:\users\dell\appdata\roaming\python\python311\site-packages (from scikit-learn) (1.13.0)
Requirement already satisfied: joblib>=1.2.0 in c:\users\dell\appdata\roaming\python\python311\site-packages (from scikit-learn) (1.4.0)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\dell\appdata\roaming\python\python311\site-packages (from scikit-learn) (3.4.0)

In [34]:
import numpy as np
import pandas as pd

In [35]:
data = pd.read_csv('Salary Data.csv')

In [36]:
data.head(5)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [37]:
data.shape

(375, 6)

In [38]:
data.isnull().sum()

Age                    2
Gender                 2
Education Level        2
Job Title              2
Years of Experience    2
Salary                 2
dtype: int64

In [39]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  373 non-null    float64
 1   Gender               373 non-null    object
 2   Education Level      373 non-null    object
 3   Job Title            373 non-null    object
 4   Years of Experience  373 non-null    float64
 5   Salary               373 non-null    float64
dtypes: float64(3), object(3)
memory usage: 17.7+ KB

In [40]:
data.dropna(inplace=True)

In [41]:
data.isnull().sum()

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

In [42]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 373 entries, 0 to 374
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  373 non-null    float64
 1   Gender               373 non-null    object
 2   Education Level      373 non-null    object
 3   Job Title            373 non-null    object
 4   Years of Experience  373 non-null    float64
 5   Salary               373 non-null    float64
dtypes: float64(3), object(3)
memory usage: 20.4+ KB

In [43]:
data['Gender'].value_counts()

Gender
Male      194
Female    179
Name: count, dtype: int64

In [44]:
data['Education Level'].value_counts()

Education Level
Bachelor's    224
Master's       98
PhD            51
Name: count, dtype: int64

In [45]:
data['Job Title'].value_counts()

Job Title
Director of Marketing              12
Director of Operations             11
Senior Business Analyst            10
Senior Marketing Analyst            9
Senior Marketing Manager            9
                                   ..
Business Development Manager        1
Customer Service Representative     1
IT Manager                          1
Digital Marketing Manager           1
Junior Web Developer                1
Name: count, Length: 174, dtype: int64

In [46]:
data['Job Title'].value_counts().head(10)

Job Title
Director of Marketing                    12
Director of Operations                   11
Senior Business Analyst                  10
Senior Marketing Analyst                  9
Senior Marketing Manager                  9
Junior Business Analyst                   8
Senior Financial Analyst                  7
Junior Financial Analyst                  7
Junior Business Development Associate     7
Senior Project Manager                    7
Name: count, dtype: int64

In [47]:
def add_model(job_title):
    job_counts = data['Job Title'].value_counts()
    if job_counts.get(job_title) > 10:
        return job_title
    else: 
        return " ".join(job_title.split()[1:3])

data['job_name'] = data['Job Title'].apply(add_model)

In [48]:
data['job_name'].value_counts().head(20)

job_name
Manager                   19
Business Analyst          18
Marketing Manager         15
Financial Analyst         14
Project Manager           13
Marketing Analyst         12
Director of Marketing     12
Business Development      11
Director of Operations    11
Product Manager           10
Marketing Coordinator      9
Marketing Specialist       9
Operations Manager         9
Data Scientist             8
Analyst                    8
Software Engineer          7
Operations Analyst         7
Sales Representative       6
Scientist                  6
                           6
Name: count, dtype: int64

In [49]:

def add_model2(value):
    job_counts2 = data['job_name'].value_counts()
    if job_counts2.get(value) > 6:
        return value
    else:
        return 'Other'

data.loc[:, 'job_name'] = data['job_name'].apply(add_model2)

In [50]:
data['job_name'].value_counts().head(20)

job_name
Other                     181
Manager                    19
Business Analyst           18
Marketing Manager          15
Financial Analyst          14
Project Manager            13
Marketing Analyst          12
Director of Marketing      12
Director of Operations     11
Business Development       11
Product Manager            10
Operations Manager          9
Marketing Specialist        9
Marketing Coordinator       9
Data Scientist              8
Analyst                     8
Software Engineer           7
Operations Analyst          7
Name: count, dtype: int64

In [51]:
data.head(5)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,job_name
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0,Other
1,28.0,Female,Master's,Data Analyst,3.0,65000.0,Analyst
2,45.0,Male,PhD,Senior Manager,15.0,150000.0,Manager
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0,Other
4,52.0,Male,Master's,Director,20.0,200000.0,Other

In [52]:
data1=data.drop(columns=['Job Title','Gender'])

In [53]:
data1.head(5)

    Age Education Level  Years of Experience    Salary job_name
0  32.0      Bachelor's                  5.0   90000.0    Other
1  28.0        Master's                  3.0   65000.0  Analyst
2  45.0             PhD                 15.0  150000.0  Manager
3  36.0      Bachelor's                  7.0   60000.0    Other
4  52.0        Master's                 20.0  200000.0    Other

In [54]:
data2=pd.get_dummies(data1).astype(int)

In [55]:
data2.head(2)

,Age,Years of Experience,Salary,Education Level_Bachelor's,Education Level_Master's,Education Level_PhD,job_name_Analyst,job_name_Business Analyst,job_name_Business Development,job_name_Data Scientist,...,job_name_Marketing Analyst,job_name_Marketing Coordinator,job_name_Marketing Manager,job_name_Marketing Specialist,job_name_Operations Analyst,job_name_Operations Manager,job_name_Other,job_name_Product Manager,job_name_Project Manager,job_name_Software Engineer
0,32,5,90000,1,0,0,0,0,0,0,...,0,0,0,0,0,0,1,0,0,0
1,28,3,65000,0,1,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [56]:
data2.shape

(373, 24)

In [57]:
X = data2.drop('Salary', axis=1)
y = data2['Salary']

In [58]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.25)

In [59]:
X_train.shape, X_test.shape

((279, 23), (94, 23))

In [60]:
def model_acc(model):
    model.fit(X_train, y_train)
    acc = model.score(X_test, y_test)
    print(str(model)+ ' --> ' +str(acc))

In [61]:
from sklearn.linear_model import LinearRegression
lr = LinearRegression()
model_acc(lr)

from sklearn.linear_model import Lasso
lasso = Lasso()
model_acc(lasso)

from sklearn.tree import DecisionTreeRegressor
dt = DecisionTreeRegressor()
model_acc(dt)

from sklearn.ensemble import RandomForestRegressor
rf = RandomForestRegressor()
model_acc(rf)

LinearRegression() --> 0.9114730750220473
Lasso() --> 0.9114642693306676
DecisionTreeRegressor() --> 0.8929976537943307
RandomForestRegressor() --> 0.9401808104646704

In [63]:
from sklearn.model_selection import GridSearchCV

parameters = {'n_estimators':[25, 50, 100],
              'criterion':['squared_error','absolute_error','poisson']}

grid_obj = GridSearchCV(estimator=rf, param_grid=parameters)

grid_fit = grid_obj.fit(X_train, y_train)

best_model = grid_fit.best_estimator_

best_model.score(X_test, y_test)

0.946797067285095

In [64]:
import pickle
with open('predictor1.pickle', 'wb') as file:
    pickle.dump(best_model, file)

In [65]:
X_test.columns

Index(['Age', 'Years of Experience', 'Education Level_Bachelor's',
       'Education Level_Master's', 'Education Level_PhD', 'job_name_Analyst',
       'job_name_Business Analyst', 'job_name_Business Development',
       'job_name_Data Scientist', 'job_name_Director of Marketing',
       'job_name_Director of Operations', 'job_name_Financial Analyst',
       'job_name_Manager', 'job_name_Marketing Analyst',
       'job_name_Marketing Coordinator', 'job_name_Marketing Manager',
       'job_name_Marketing Specialist', 'job_name_Operations Analyst',
       'job_name_Operations Manager', 'job_name_Other',
       'job_name_Product Manager', 'job_name_Project Manager',
       'job_name_Software Engineer'],
      dtype='object')

In [66]:
pred_value = best_model.predict([[27, 8, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0,0,1,0,0]])
pred_value

C:\Users\DELL\AppData\Roaming\Python\Python311\site-packages\sklearn\base.py:493: UserWarning: X does not have valid feature names, but RandomForestRegressor was fitted with feature names
  warnings.warn(

array([86050.])